{
  "experiencias_academicas": [
    {
      "cargo": "assessor de comunicação",
      "instituicao": "NEJ Salvador",
      "inicio": "abr 2019",
      "final": "jul 2019",
      "descricao": "Integrei o primeiro time do Núcleo de Empresas Juniores de Salvador, atuando na área de comunicação e mídias sociais, com foco em criação de conteúdo e gestão de anúncios."
    },
    {
      "cargo": "diretor de marketing e vendas",
      "instituicao": "Praxis Empresa Jr",
      "inicio": "jan 2019",
      "final": "jul 2019",
      "descricao": "Desenvolvi habilidades de liderança e colaboração ao assumir a diretoria de Marketing e Vendas, contribuindo com estratégias de expansão e relacionamento com clientes."
    },
    {
      "cargo": "projetista do núcleo de T.I",
      "instituicao": "Praxis Empresa Jr",
      "inicio": "jan 2018",
      "final": "jul 2019",
      "descricao": "Atuei em projetos de tecnologia, desenvolvendo soluções para clientes e adquirindo experiência prática em desenvolvimento web e gestão de demandas reais."
    },
    {
      "cargo": "voluntário",
      "instituicao": "Pure Startup",
      "inicio": "mar 2018",
      "final": "jun 2018",
      "descricao": "Participei de ações voltadas ao empreendedorismo e inovação tecnológica, contribuindo com suporte em eventos e na organização de atividades colaborativas."
    },
    {
      "cargo": "membro da liga de programação em C",
      "instituicao": "UNIFACS",
      "inicio": "fev 2017",
      "final": "nov 2017",
      "descricao": "Atuei como membro e posteriormente como monitor da liga acadêmica, realizando desafios e promovendo a troca de conhecimento em linguagem C entre os participantes."
    }
  ],
  "experiencias_profissionais": [
    {
      "cargo": "analista de sistemas pleno",
      "instituicao": "Prefeitura de Salvador",
      "inicio": "nov 2022",
      "final": "",
      "descricao": "Desenvolvimento fullstack com PHP (Laravel), Vue.js e Oracle, com foco na criação de APIs e sistemas que aprimoram a gestão financeira municipal. Integro o time da controladoria geral, atuando em projetos estratégicos de controle interno."
    },
    {
      "cargo": "analista de sistemas júnior",
      "instituicao": "ACP Group",
      "inicio": "nov 2021",
      "final": "nov 2022",
      "descricao": "Atuação em sistemas para órgãos públicos, utilizando Laravel e Vue.js em conjunto com SQL Server. Trabalhei em times ágeis (Scrum/Kanban) e com infraestrutura baseada em Docker."
    },
    {
      "cargo": "desenvolvedor web e mobile",
      "instituicao": "GA Software",
      "inicio": "fev 2021",
      "final": "nov 2021",
      "descricao": "Atuei no desenvolvimento de interfaces web com foco em Vue.js e Laravel, além da criação de APIs para integração entre sistemas. Também participei da construção de aplicativos móveis multiplataforma."
    }
  ]
}
