{
  "experienciasAcademicas": [
    {
      "titulo": "Assessor de Comunicação",
      "empresa": "NEJ Salvador",
      "periodo": "abr 2019 - jul 2019",
      "descricao": "Atuei na fundação do Núcleo de Empresas Juniores de Salvador, liderando iniciativas de comunicação e mídias sociais. Fui responsável por planejar e executar campanhas, gerenciar anúncios e criar conteúdos institucionais, fortalecendo a presença digital do núcleo.",
      "icone": "fa-solid fa-building-circle-check"
    },
    {
      "titulo": "diretor de marketing e vendas",
      "empresa": "Praxis Empresa Jr",
      "periodo": "jan 2019 - jul 2019",
      "descricao": "Conduzi estratégias de marketing e relacionamento com clientes, estruturando funis de vendas e campanhas de comunicação. Desenvolvi competências de liderança, negociação e trabalho em equipe, além de expandir networking e soft skills essenciais para o mercado.",
      "icone": "fa-solid fa-building-circle-check"
    },
    {
      "titulo": "projetista do núcleo de T.I",
      "empresa": "Praxis Empresa Jr",
      "periodo": "jan 2018 - jul 2019",
      "descricao": "Participei do desenvolvimento de sistemas e sites institucionais para clientes reais, aplicando PHP, MySQL e Bootstrap. Contribuí para a entrega de soluções tecnológicas funcionais e adequadas às necessidades do mercado.",
      "icone": "fa-solid fa-building-circle-check"
    },
    {
      "titulo": "membro da liga de programação em C",
      "empresa": "Universidade Salvador",
      "periodo": "fev 2017 - nov 2017",
      "descricao": "Promovi estudos avançados em programação estruturada e boas práticas de codificação. Atuei como membro, orientando colegas na resolução de desafios e troca de conhecimento técnico.",
      "icone": "fa-solid fa-users-line"
    }
  ],
  "experienciasProfissionais": [
    {
      "titulo": "Analista de Sistemas Pleno",
      "empresa": "Prefeitura de Salvador",
      "periodo": "nov 2022 - Atualmente",
      "descricao": "Desenvolvimento full stack em PHP (Laravel), Vue.js e Oracle, com foco em APIs e sistemas financeiros municipais. Destaques: Criação do Sistema de Trilhas, que aumentou a autonomia dos auditores e reduziu tempo de análise. Desenvolvimento e publicação da API de Empenhos, ampliando a transparência fiscal e permitindo integrações em tempo real. Implementação de interfaces responsivas e acessíveis seguindo boas práticas de segurança e escalabilidade.",
      "icone": "fa-solid fa-briefcase"
    },
    {
      "titulo": "Analista de Sistemas Júnior",
      "empresa": "ACP Group",
      "periodo": "nov 2021 - nov 2022",
      "descricao": "Manutenção e evolução de sistemas para órgãos públicos, utilizando Laravel, Vue.js e SQL Server. Garantia de disponibilidade e segurança de sistemas críticos, como a gestão de contas Microsoft da PRODEB-BA. Desenvolvimento do Sistema de Prestação de Contas da SEFAZ Camaçari, aumentando a precisão e transparência na gestão fiscal. Configuração de ambientes com Docker e uso de autenticação JWT para aplicações seguras e escaláveis.",
      "icone": "fa-solid fa-briefcase"
    },
    {
      "titulo": "Desenvolvedor Web e Mobile",
      "empresa": "GA Software",
      "periodo": "fev 2021 - nov 2021",
      "descricao": "Desenvolvimento de sistemas de gestão e interfaces web/mobile com Vue.js, Quasar e Laravel. Foco em usabilidade, acessibilidade e performance, melhorando a experiência do usuário. Modelagem de bancos de dados PostgreSQL e implementação de SPAs com integração de APIs RESTful.",
      "icone": "fa-solid fa-briefcase"
    }
  ],
  "experienciasOutras": [
    {
      "titulo": "Top 10 projetos (BIMI)",
      "empresa": "Hackathon Bemobi",
      "periodo": "nov 2024",
      "descricao": "Desenvolvimento de um atendente virtual com IA (Gemini), oferecendo interações personalizadas, respostas rápidas e automação de processos de suporte. O projeto melhorou a eficiência do atendimento e otimizou o tempo de resposta.",
      "icone": "fa-solid fa-diagram-project"
    },
    {
      "titulo": "Top 6 projetos (IrrigaGo)",
      "empresa": "Hackathon CPGoiás4",
      "periodo": "nov 2024",
      "descricao": "Criação de uma plataforma de gerenciamento de irrigação agrícola, integrando dados climáticos e de qualidade da água para otimizar o uso de recursos hídricos e aumentar a produtividade.",
      "icone": "fa-solid fa-diagram-project"
    },
    {
      "titulo": "Fundador",
      "empresa": "Athos Startup",
      "periodo": "mar 2018 - jun 2018",
      "descricao": "Idealização de uma solução ERP modular para pequenas empresas, com APIs REST em .NET, dashboards em Vue e sistemas de gestão de estoque e e-commerce, permitindo que clientes escolhessem apenas os módulos necessários.",
      "icone": "fa-solid fa-people-roof"
    },
    {
      "titulo": "Voluntário",
      "empresa": "Pure Startup",
      "periodo": "mar 2018 - jun 2018",
      "descricao": "Apoio a eventos e iniciativas de empreendedorismo, além do desenvolvimento do site institucional utilizando HTML5, CSS3, JavaScript e Bootstrap.",
      "icone": "fa-solid fa-handshake-angle"
    }
  ]
}
